Revit 2026 API

# StructuralSectionGeneralLALipLength Property

---

Lip segment length.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LipLength { get; set; }
```
```vb
Public Property LipLength As Double
	Get
	Set
```
```cpp
public:
property double LipLength {
	double get ();
	void set (double value);
}
```
```fsharp
member LipLength : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralLA Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace